Revit 2021.1 API
Definition Members
The Definition type exposes the following members.
Methods
Name | Description
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetSpecTypeId
 Gets the identifier of the spec describing values of the parameter.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Name
The user visible name for the parameter.
ParameterGroup
 Returns the group ID of the parameter definition.
ParameterType
Returns the user visible interpretation of the parameter data.
UnitType |  Obsolete.
 Returns the UnitType of the parameter definition.
See Also
Definition Class
Autodesk.Revit.DB Namespace